{"Anatomy-of-an-Internet-Argument":{"title":"Anatomy of an Internet Argument","links":[],"tags":[],"content":"TODO\nRelated:\n\nwww.anti-debate.org/ by Stephanie Lepp (x.com/stephlepp)\n"},"Consciousness":{"title":"Consciousness","links":[],"tags":[],"content":"Consciousness is a consensus mechanism by Sai Gaddam (x.com/SaiDrGaddam)\n\n\nYou are a constellation of past experiences, experiencing the present, assimilating it to act and prepare for future opportunities, creating the new You.\nConsciousness is the consensus mechanism through which this constellation creates the next experience, which then becomes a part of the constellation.\nYou feel, because it is only through this feeling that you emerge\n\n"},"Marketing-companies-into-existence":{"title":"Marketing companies into existence","links":["ORI/Retroactive-funding"],"tags":[],"content":"\nIdentify a need\nBuild a prototype or mockup\nMarket it, get user feedback, stir up interest from funders/investors\nRelease the source code / your plan, let others build it. Connect the builders, the users, and the funders\nGain status &amp; attention. Repeat step 1\n\nThis is one way to basically “steer the economy” through storytelling. Here you’re acting as a kind of product manager for civilization. The more realistic &amp; feasible your pitches are, the more attention you get on your future pitches, and the more likely they will happen.\nHow to fund yourself? When you generate a success here, you grow the pie, and can get Retroactive funding. Otherwise, make “content” out of the story (as a youtuber etc)."},"ORI/Peer-review-doubles-as-marketing":{"title":"Peer review doubles as marketing","links":[],"tags":[],"content":"TODO"},"ORI/Retroactive-funding":{"title":"Retroactive funding","links":[],"tags":[],"content":"TODO\nExamples\nMichael Edward Johnson (philosopher &amp; neuroscientist)\n\nPrincipia Qualia offered a blueprint for building a new science of consciousness; my efforts at QRI were aimed at realizing this. I’m now interested in fostering a diversity of such organizations.\nMy research is almost entirely funded by retroactive donations; if you like the work I’ve done, consider supporting it via a direct donation.\nopentheory.net/contact/\n"},"_/How-the-Twitter-Community-Archive-started":{"title":"How the Twitter Community Archive started","links":["Marketing-companies-into-existence"],"tags":[],"content":"\nThis is a project to (1) collect twitter archives from volunteers to study ourselves (2) build open source tools for collection &amp; analysis so that other communities can reproduce this work on their own data.\ngithub.com/DefenderOfBasic/PhD/blob/main/twitter-community-archive.md\n\nThis story is an example of Marketing companies into existence.\nOn Dec 2023 I wrote:\n\nI want this to exist so badly and I want to see how far I can take it with just Twitter search and lots of manual curation\nMaybe even a little initiative to export a bunch of our Twitter archives and apply some interesting semantic clustering and visualization\nx.com/DefenderOfBasic/status/1734912039598928379\n\nOn July 2024 I made a prototype where anyone could upload their twitter archive\n\nhere’s all my tweets, grouped by threads, and I can client-side search it\nx.com/DefenderOfBasic/status/1816225499888378197\n\nXiq (x.com/exgenesis) saw this and built a non-prototype version of it. I wrote about it and it got on the front page of HN:\n\nTwitter shut off API access; users are now volunteering their data for an open API\nA lot of community applications died when API access to twitter, reddit &amp; others was severely restricted, but they can’t stop us from sharing our own data with each other!\nomarshehata.substack.com/p/twitter-shut-off-api-access-users\n\nThe more users we got, the more interesting insights &amp; analysis we could do, which attracted more users. Eventually in April 2025 I made a tweet about “the first glimpse of the nooscope” which attracted investors/funding.\n\nwe’re already getting the first views of what our collective mind looks like under a nooscope! Each “clump” here is an attractor in idea space, naturally forming structures in the space between our minds\nx.com/DefenderOfBasic/status/1908916969467687181\n\nThe demo itself was made by Brandon @ nomic, in our discord. I just made a video of it and tweeted it / explained why this was cool."},"_/Human-Memome-Project":{"title":"Human Memome Project","links":[],"tags":[],"content":"TODO\nReviewers\n\nx.com/giggleskwelch\nx.com/mudscryer\nemergentvibe\nx.com/toastreuben\n"},"_/Religion-Was-Discovered,-Not-Invented":{"title":"Religion Was Discovered, Not Invented","links":[],"tags":[],"content":"Someone wrote an essay that I could respond to with one called “What is Religion?”\nx.com/Hshsiwkmefbg/status/1922554563728437271\n\nReligion, culture and institutions On the definition, categorization, origin and historical (and contemporary) role of religion (as distinct from the rest of culture and non-religious institutions)\n\n\nPeople I want to respond to with this essay:\n\nRuben Moor sees religion as bad, points out all the bad parts of it, why would I defend it? x.com/RubenMoor/status/1921929041931558994\n\n\nAre you defending sort of a religious positivism? Maybe you find something in here to contradict, something about the role of religion in society that I underestimate.\n\n\nSam McRoberts understands religion, agrees that fighting it from the outside “activates its defenses”, but argues the label is “tainted beyond repair”  x.com/Sams_Antics/status/1921666949777371375\n\n\nYou are correct that criticizing it just raises defenses, and (if you’d ever read The Grand Resesign you would know I agree) that replacing it with a different system with some of the same good bits is the right path, but you’re going to need to discard the label religion. It’s tainted beyond recovery.\n"},"_/TODO":{"title":"TODO","links":[],"tags":[],"content":"\n\nKnowledge Gate, write about this as a project for ORI. “unit tests for concepts”\n\nexample: when I find someone who has a theory for “multi dimensional capitalism” I want to overlap it/compare it with speaker john ash’s cogniticism\n\n\n\nGenerate bigrams for individuals, and for the whole community (and over time? )\n\n"},"_/backup_may_2025/Drafts--and--scratch-space/Inspiration":{"title":"Inspiration","links":[],"tags":[],"content":"\nDouglas Engelbart en.wikipedia.org/wiki/The_Mother_of_All_Demos\nTom Fulp\nBret Victor (Inventing on Principle)\n"},"_/backup_may_2025/Drafts--and--scratch-space/notes":{"title":"notes","links":[],"tags":[],"content":"\n“ecumenical consilience” is a big concept for me\n“gnostic peer review”\n"},"_/backup_may_2025/Memetics/How-does-a-breakthrough-reach-the-physicists":{"title":"How does a breakthrough reach the physicists?","links":[],"tags":[],"content":"Once you find a breakthrough, how DOES it spread in society?\n\nWoah. I gotta be honest, I was expecting some complete pseudoscience bs from this. Just finished a first read-through and I’m blown away, and think that the author should immediately work with “credentialed” physicists to get this into the scientific mainstream (Nature paper).\nx.com/BenShindel/status/1912526687973126298\n\nBen debates here the best way to actually get the attention of mainstream physicists. Is a big nature paper enough? or a scientific magazine with high standards like Quanta?\n\nI think the stated goal of the author is to bring about a paradigm shift in physics. In order to do that you have to get mainstream physicists on board.\nx.com/BenShindel/status/1912526687973126298\n\nI think the Human Memeome Project will solve this kind of problem as a side effect. Answering the question of how DOES good information spread in the current networks? If you are outside the scene, and you found something important, how do you communicate it to insiders?\nStudying it has this reflexive property, by looking at where information bottlenecks are, our attention fixes them."},"_/backup_may_2025/Memetics/Is-culture-splitting":{"title":"Is culture splitting?","links":[],"tags":[],"content":"x.com/DefenderOfBasic/status/1878281206720090145\n\nThe memeome project is how we know, or remain tethered as a species."},"_/backup_may_2025/Memetics/Journal":{"title":"Journal","links":[],"tags":[],"content":"Collecting things here that I’d like to feature in the Open Memetics Journal\n\nHas this been discussed or looked into here? www.newsguardtech.com/special-reports/moscow-based-global-news-network-infected-western-artificial-intelligence-russian-propaganda/ I heard Leo talk about how you could seed info into LLMs if enough people co-ordinated, but its the first headline about it\n\n\n\nExperimental Memetics: 2017 Alabama Special Senate Election Results paper\n\nby David Goldstein, @everykfool\n\n\n\nthegrandredesign.com/ by Sam\n\n\nessay from everykfool\n\n\nRally and hammert\n\n\nConstructual Law ?\n\n\nRay Doriamasy’s newsletter\n\n\ndeep dive into Michael Garfield’s stuff"},"_/backup_may_2025/Memetics/notes":{"title":"notes","links":[],"tags":[],"content":"\nWrite something about Hank Green’s memetic engineering, get it reviewed by emergent &amp; bradie\nWrite about my “how to run an open memetics experiment”\n\nwhere I talk about the “Shape of America”, how it spreads knowledge while also testing people at the same time, “dual purpose”\n\n\nWrite about the “Human memeome project”\nWrite about “the initial spark”, what that is, what some of my ideas are for it\n\nProject for google forms → cluster responses, all 100% in the browser\nTODO: write about substack’s pysop (bringing legit people next to anyone to legitimize the platform)\nWhat subcultures do I have access to?\n\npeople who create internet standards (glTF/WebGPU etc)\nmedical doctors\naccountant / energy company\n“people struggling to pay rent” - x.com/DefenderOfBasic/status/1689723613883011072\n\n“would someone trust you with children?”"},"_/backup_may_2025/Open-Research-Institute/Comparables":{"title":"Comparables","links":[],"tags":[],"content":"\nMycelial Institute by mykola and vixamechana\nwww.cosmik.network/ by Ronen Tamari.\n\nMichael can intro, see twitter thread\n\n\nTianmu (tianmu.org/Tianmu+Theosophical+Society/Homepage)\n\nHexafield knows of more:\n\nOh there’s a few of these, I’m mapping the ecosystem out, look at AD4M/Flux\n@coasys_dao too.\n\nSee also\n\nDiscourse Graphs discoursegraphs.com/. @theproteindance  has a contact there. They already have research labs using this! It’s also open source and has plugins for various things like Obsidian??\nIdeaflow is working on an interconnected research notebook (www.ideaflow.io/).\nFiltering the Information Network on X by Alexander Pacheco\n"},"_/backup_may_2025/Open-Research-Institute/Metaphysics-101":{"title":"Metaphysics 101","links":[],"tags":[],"content":"\nthe books i really want to read right now are a “metaphysics 101” (that enough people on the frontier might endorse) and “rigorous mysticism” (how to calibrate your intuition). These are like the onboarding guides to ORI\n\nx.com/DefenderOfBasic/status/1913737079227322686\n\nFrom Michael Garfield (www.youtube.com/watch)\nAlexander Yiannopoulos’s manuscript &lt;ayiannopoulos@protonmail.com\n\nx.com/quantabhidharma/status/1913752204810616999\n\n\n\nDouglas Hofstader (I Am A Strange Loop)\nThe Bible??? (see Matthew Prague)"},"_/backup_may_2025/Open-Research-Institute/New-paradigms":{"title":"New paradigms","links":[],"tags":[],"content":"\nQRI on consciousness\n\nMichael Levin &amp; bioelectricity &amp; distributed consciousness\n“active inference theory of consciousness” x.com/RubenLaukkonen/status/1899303797148762597\n\n\nMemetics\n\ndefenderofthebasic.substack.com/p/a-beginners-guide-to-culture-science\n\n\nThe Blowtorch Theory: A New Model for Structure Formation in the Universe\n\ntheeggandtherock.com/p/the-blowtorch-theory-a-new-model\n\n\nBreeze Theory (recursive reality)\n\nbreezetheory.com/\n\n\nSubspace Institute (quantum physics)\n\nsubspaceinstitute.com/bbpress/forums/forum/whitepaper/\n\n\nJustin Bailey, “metamodels” www.mindmathmusic.com/math\n\n“bit crush” x.com/pk_htown/status/1896884896293167605\n\n\nMatter as Machine\n\nx.com/matterasmachine\n\n\nThe science of purpose &amp; consciousness as fundamental\n\nogiogas.substack.com/p/an-introduction-to-the-overneglected\nogiogas.substack.com/p/the-cosmic-cycle-how-nothing-changes\n\n\nPhilodosy (science of “best possible world” / universal alignment)\n\nTODO: get notes from suntzoogway\n\n\n\nThis guy cataloguing theories of everything x.com/TOEwithCurt"},"_/backup_may_2025/Projects/Org-Chart-for-Spaceship-Earth":{"title":"Org Chart for Spaceship Earth","links":[],"tags":[],"content":"TODO\ncurrent draft: github.com/DefenderOfBasic/org-chart"},"_/backup_may_2025/Projects/Semantically-cluster-any-Blue-Sky-thread":{"title":"Semantically cluster any Blue Sky thread","links":[],"tags":[],"content":"Like the treeverse app, but semantically instead of just looking at a tree. Then after that do it with Hacker News.\nThis is a “bottom up” way to spread this interface."},"_/backup_may_2025/Projects/Twitter-Archive-->-Obsidian-Vault":{"title":"Twitter Archive -> Obsidian Vault","links":[],"tags":[],"content":"Inspiration: omarshehata.me/html/twitter-clustering/test.html\nThis will be a good start for people to publish a research notebook, and then all this stuff that works on Obsidian (like semantic search, clustering across) will work on twitter archives."},"_/backup_may_2025/index2":{"title":"Defender's Notebook","links":[],"tags":[],"content":"This is my open research notebook. I’m currently thinking a lot about consciousness, memetics, coordination, and philodosy (universal alignment / love pill / religion)\nMy background is in computer science &amp; math. I worked in tech for 6 years (geospatial software). Used to make flash games on Newgrounds back in the day.\nFind my long form polished writing on Substack (defenderofthebasic.substack.com/about). I’m also active on twitter (x.com/DefenderOfBasic)."},"index":{"title":"📝 Defender's notebook","links":["⭐️-Open-Research-Institute"],"tags":[],"content":"Currently working on bootstrapping the ⭐️ Open Research Institute which is a missing piece of infrastructure for civilization-wide coordination.\nAlso working on evangelizing “open memetics” / open source &amp; decentralized cultural engineering. This is necessary for “steering the ship” towards the best possible future for all sentient beings. This is “universal alignment”, AI alignment is a subset of this problem.\nMy background is in software engineering (computer graphics / geospatial / game dev), and marketing / community management (have been a maintainer of a large open source project, hosted hackathons/game jams etc).\nPlaces to find me:\n\nLong form writing on Substack: defenderofthebasic.substack.com/about\nTwitter for public correspondance: x.com/DefenderOfBasic\nOpen Memetics Discord: discord.gg/5mbWEfVrqw (originally part of the “Twitter Community Archive” project)\n\nFriends / collaborators / advisors\nTODO"},"memetics/Collaborators":{"title":"Collaborators","links":[],"tags":[],"content":"People who are working in the same space / trying to do the same things I’m trying to do.\n\nVidhvat x.com/vidhvatm\nVie x.com/viemccoy\nHalina x.com/halina_eth\nEtymology Nerd etymology.substack.com/\n"},"memetics/Open-Memetics-Journal":{"title":"Open Memetics Journal","links":[],"tags":[],"content":"Announcement post: defenderofthebasic.substack.com/p/open-memetics-journal-call-for-submissions\nThis is a newsletter/journal to help people working in open memetics find each other. Here is where I keep things I want to  feature &amp; write about.\n\n\nDavid Goldstein on “how to meddle in an election”, a documented open memetics experiment\n\n\nPlanet Money interviewed him here: How to meddle in an election. He wrote his own write up here: Example of Experimental Memetics in the Wild: Memetics Deployed to Affect Voter Turnout in 2017 US Senate race in Alabama"},"⭐️-Open-Research-Institute":{"title":"⭐️ Open Research Institute","links":[],"tags":[],"content":""},"\"Half-Art-Half-Science\"-is-not-the-maximum-it-can-be":{"title":"\"Half Art Half Science\" is not the maximum it can be","links":[],"tags":[],"content":"When people say something is “half art” / “half science”, to me that is a kind of scissor statement. It shows they have the wrong metaphor for understanding what these two things are &amp; how they relate.\nSomething can be (1) not art, (2) art, or (3) great, profound, beautiful art.\nSomething can be (1) not science, (2) science, or (3) breakthrough, brilliant, useful science.\nThese aren’t on an axis of one to the other. They are two separate axes.\n"},"ORI/Universal-Principles/Unbundle-the-axes":{"title":"Unbundle the axes","links":["ORI/Universal-Principles/Unbundle-the-axes"],"tags":[],"content":"I found it for emotional/rational.\nSun found it for capitalism / communism.\nExample: Unbundle the axes"},"_/books/Who-Are-We-Now":{"title":"Who Are We Now","links":[],"tags":[],"content":"Thread on my thoughts / what I liked about it:\nx.com/DefenderOfBasic/status/1818811919714709839\n\nreading “Who Are We Now” has been so meaningful for me. I think reading it has taught me how to decipher the world, watching Blaise ask big questions about society and work through (1) how we can go about answering it (2) why we should/shouldn’t trust the answers we find\n\n\ni think this is the most meaningful piece to me. it’s the “here’s what we know. but also, let me tell you HOW we know this, so you can decide for yourself.” he doesn’t talk down to the reader. he lifts up the reader. why is this so rare\n\nLearned about it from Steve Levitt’s podcast: freakonomics.com/podcast/are-our-tools-becoming-part-of-us/"}}